{
  "basics": {
    "name": "Chris Game",
    "label": "Software Engineer",
    "picture": "https://en.gravatar.com/userimage/27996871/01463d83dffa3b7e246b856e3f3c2da2.jpg?size=200",
    "email": "christopherjohngame@gmail.com",
    "summary": "A passionate software engineer, I'm always seeking to improve my knowledge and technical understanding. With over 18 years of developer experience, I have a good understanding of “full stack development” - not just frontend/backend code, but the experience of taking an idea all the way through development, release and on to support and performance tuning. Having been in this feedback loop for the last few years, I've learnt a lot about how to optimize development for the longterm. I care deeply about my work and dedicate a significant amount of my downtime on improving my technical knowledge, Ember specialism and data-driven documents (d3.js).",
    "location": {
      "city": "St Albans",
      "countryCode": "UK",
      "region": "Hertfordshire"
    },
    "profiles": [{
      "network": "Twitter",
      "username": "@TheGameOf79",
      "url": "https://twitter.com/TheGameOf79"
    },
    {
      "network": "GitHub",
      "username": "ChrisGame",
      "url": "https://github.com/chrisgame"
    },
    {
      "network": "LinkedIn",
      "url": "http://uk.linkedin.com/in/chrisgame"
    }]
  },
  "work": [
    {
      "company": "Kayako",
      "position": "Software Engineer",
      "website": "http://<your-instance-name>.kayako.com/agent",
      "website": "http://<your-instance-name>.kayako.com/admin",
      "website": "https://www.kayako.com/free-trial",
      "startDate": "2015-04-27",
      "endDate": "2018-03-01",
      "summary": "Working closely with the founders to build and improve the product, Kayako is a SaaS solution that allows customers to manage conversations across many different channels. My time was focused on the areas of the app that the agent uses to reply to customers and administer their instance. This was a single app written in Ember. Having used Ember in my previous role, I was very keen to specialise and create even more ambitious apps like Kayako, which uses a number of complex features including an infinitely scrolling timeline of variable size items, multiple complex selection components including an automation rule builder, graphical search composer and a complex in-app tab solution.",
      "highlights": [
        "Contributed to open-source projects (something I would like to continue doing).",
        "Working closely with design to make sure that the finished article was as good as it could possibly be, including simple things like making sure SVGs render clearly in all states, to more complicated issues that involved iterating on designs after feedback from user testing.",
        "Diagnosed complex performance problems, some of which could be fixed immediately, and others that needed to be worked around until improvements were made to the Ember framework it's self.",
        "Introduced automated testing practices to the team to stop regressions occurring in the product. Convinced the team to use ember-cli-mirage, to have a complete mock of the api for testing. This also allowed us to create all the scenarios that only occurred occassionally and make sure that we were handling them correctly by building tests for them in the CI process.",
        "Go-to expert for debugging Ember apps, improving team productivity significantly.",
        "Coaching “junior” engineers to help develop their skills, knowledge and thought processes"
      ]
    },
    {
      "company": "BSkyB",
      "position": "Agile Software Engineer",
      "website": "http://help.sky.com",
      "website": "http://broadbandconnection.sky.com",
      "website": "http://servicestatus.sky.com",
      "startDate": "2009-05-01",
      "endDate": "2015-04-24",
      "summary": "My current role has allowed me to explore the benefits of various automation techniques and tools to improve the productivity and ownership of the team. Over the years I found a good set of tools in github, circle ci, browserstack and heroku that have allowed myself and the rest of the team to develop a reputation within the company for cost effective high quality solutions. This also meant I was rewarded the control to hire and shape the team as time went on. Initially I was responsible for one java app but now that has become a suite of apps written in ruby and javascript. More specifically ember, rails, rails-api, sinatra, sails, express and koa using data storage such as postgres, S3, redis and mongo.",
      "highlights": [
        "Introduced ruby to the team, always trying to find the right tool for the job led us on to build 100% javascript apps.",
        "Mentored others with no ruby knowledge to proficient developers whilst delivering a product to a deadline.",
        "Convinced the department heads that the developers could and should be responsible for testing their own code (a big deal in this environment!).",
        "Built a strong enough case to be allowed to deploy applications using heroku rather than the internal infrastructure.",
        "Created a continuous deployment build chain that included a step that captured screenshots of pages to check for styling regressions.",
        "Helped push the adoption of github across the department.",
        "I'm also completely happy to follow someone else's lead when they are using good tech ;-)"
      ]
    },
    {
      "company": "AOL Time Warner",
      "position": "Senior Engineer",
      "website": "http://www.aolbroadband.co.uk",
      "startDate": "2007-05-01",
      "endDate": "2009-12-20",
      "summary": "This was my first experience of working in an agile/XP environment. It was a vast improvement over the ways of working I had experienced up to this point. The feedback loop was much faster and I instantly felt I was learning at a much faster rate. This was also due to pairing, a skill I did not posses before this role, I found the experience very rewarding. I learnt a lot technically but also learnt how different peoples thought processes and ways of working vary. I use what I learnt during this time on a day to day basis. This was predominately a Java environment but ruby was used for testing and towards the end of my time in this role we were writing some of the apps in ruby.",
      "highlights": [
        "Progressing from being the one of the first junior developers the team hired to being a valued senior developer.",
        "Performing the role of scrum master for six months."
      ]
    },
    {
      "company": "Video Networks Ltd",
      "position": "Analyst Programmer",
      "website": "http://www.bloomberg.com/research/stocks/private/snapshot.asp",
      "startDate": "2001-05-01",
      "endDate": "2007-04-01",
      "summary": "Worked as a Analyst Programmer on various projects from content management to provisioning systems. The technologies here were java and C++.",
      "highlights": [
        "Actually getting to write some code! There was a lot of spec writing and architectural designing required before you were allowed to start coding."
      ]
    },
    {
      "company": "D.A. Systems",
      "position": "Analyst Programmer",
      "website": "http://www.da-systems.co.uk",
      "startDate": "2000-07-01",
      "endDate": "2001-05-01",
      "summary": "DA Systems provide IT solutions for the transport & logistics industry throughout the UK. This was a great job to have after uni. I went straight in to a small team developing a new product. I was using Delphi here.",
      "highlights": [
        "Writing an interface gateway to allow a number of mobile devices to feed data into the app."
      ]
    },
    {
      "company": "Aspley Ltd",
      "position": "Technician",
      "website": "http://www.efit.co.uk",
      "startDate": "1997-08-01",
      "endDate": "1998-09-01",
      "summary": "Aspley produce E-Fit a facial identification application that is sold mainly to the security services. My responsibilities ranged from technical support to implementing updates to the application.",
      "highlights": []
    }
  ],
  "volunteer": [],
  "education": [{
    "institution": "University Of East Anglia",
    "area": "Software Engineering",
    "studyType": "HND",
    "startDate": "1998-09-01",
    "endDate": "2000-08-01"
  }],
  "publications": [
    {
      "name": "Ever had to hack around aligning text with an image?",
      "releaseDate": "2018-03-01",
      "summary": "I did and this what i found…",
      "publisher": "Medium",
      "url": "https://medium.com/@TheGameOf79/ever-had-to-hack-around-aligning-text-with-an-image-92a68d918f00"
    },
    {
      "name": "Upgrading to Ember 2.15",
      "releaseDate": "2018-03-01",
      "summary": "We were on v2.8.3 of Ember and v2.7.0 of Ember Data so we had got quite a long way behind for various reasons but the performance improvements from the glimmer work that had been touted meant this had substantial value to our customers so we duly got stuck in to the upgrade process.",
      "publisher": "Medium",
      "url": "https://medium.com/@TheGameOf79/upgrading-to-ember-2-15-a442fbfcc72f"
    },
    {
      "name": "Help the Helper: Chasing the cause of an unstable build in Travis",
      "releaseDate": "2016-06-01",
      "summary": "Do you think travis is getting slower at running your ember build? Maybe it’s your fault?",
      "publisher": "Medium",
      "url": "https://medium.com/life-at-kayako/help-the-helper-5d490357ae27"
    },
    {
      "name": "Building software that users enjoy using is hard deploying it shouldn’t be!",
      "releaseDate": "2016-06-01",
      "summary": "Your process of deploying should be automatic, robust and give you the confidence that what is delivered to the user is what you expect.",
      "publisher": "Medium",
      "url": "https://medium.com/@TheGameOf79/building-software-that-users-enjoy-using-is-hard-deploying-it-shouldnt-be-fa921987e497"
    },
    {
      "name": "Searching and replacing across multiple files in vim",
      "releaseDate": "2016-06-01",
      "summary": "There are many ways to achieve the same thing using vim, here is a way i found to search and replace in multiple files that worked for me.",
      "publisher": "Medium",
      "url": "https://medium.com/@TheGameOf79/searching-and-replacing-across-multiple-files-in-vim-800024e9d1c9"
    },
    {
      "name": "Routes Manuva",
      "releaseDate": "2015-04-01",
      "summary": "Unpacking Ember’s Routes and the Router",
      "publisher": "Ember London Meetup",
      "url": "https://vimeo.com/124906883"
    },
    {
      "name": "Agile Horizons 2013",
      "releaseDate": "2013-06-01",
      "summary": "Spoke at a conference Sky hosted for about 200 people that included their own staff and guests from other areas of the industry including the BBC"
    }
  ],
  "interests": [
    {
      "name": "Mechanical Engineering",
      "keywords": [
        "kit car",
        "gt40",
        "mr2 mk2 rev3 turbo",
        "66' beetle",
        "tig welding",
        "fabrication"
      ]
    },
    {
      "name": "Photography",
      "keywords": [
        "canon"
      ]
    },
    {
      "name": "DIY",
      "keywords": [
        "plumbing",
        "plastering",
        "demolition"
      ]
    },
    {
      "name": "Beer",
      "keywords": [
        "doombar",
        "broadside",
        "etc"
      ]
    }
  ]
}
